app/Http/Controllers/User/AuthController.php

select * from `generalsettings` limit 1
insert into `login_logs` (`user_id`, `ip`, `country`, `city`, `updated_at`, `created_at`) values (1, '::1', '', '', '2022-09-05 01:06:21', '2022-09-05 01:06:21')
---
    public function login(Request $request)
    {
      $gs = Generalsetting::first();
      $username = filter_var($request->user, FILTER_VALIDATE_EMAIL);
      $request->validate([
        'user'  => ['required', $username != false ? 'email':''],
        'password'  => 'required',
        'g-recaptcha-response' => [$gs->recaptcha ? 'required':'']
      ],
      [
        'user.required' => 'Email or Username required',
        'user.email' => 'Email must be a valid email address',
        'g-recaptcha-response.required' => 'Please verify that you are not a robot',
      ]);

      if($username) $key = 'email';
      else $key = 'username';

      if (Auth::attempt([$key => $request->user, 'password' => $request->password])) {
        LoginLogs::create([
            'user_id' => auth()->id(),
            'ip' => @loginIp()->geoplugin_request,
            'country' => @loginIp()->geoplugin_countryName,
            'city' => @loginIp()->geoplugin_city,
        ]);