app/Http/Controllers/User/DepositController.php

    public function index()
    {
        Session::forget('deposit_data');
        return view('user.deposit.index',[
            'currencies' => Currency::whereStatus(1)->get(),
        ]);
---
select * from `currencies` where `status` = 1

    public function methods(Request $request)
    {
        $methods = PaymentGateway::whereJsonContains('currency_id',$request->currency)->where('status',1)->get();
---
select * from `payment_gateways` where json_contains(`currency_id`, '\"1\"') and `status` = 1

    public function dipositHistory()
    {
        $deposits = Deposit::where('user_id',auth()->id())->latest()->paginate(15);
---
select * from `deposits` where `user_id` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `deposits` where `user_id` = 1

    public function depositSubmit(Request $request)
    {
        $request->validate(['amount'=>'required|gt:0','gateway'=>'required']);
        $currency = Currency::findOrFail($request->currency);
        $gateway = PaymentGateway::findOrFail($request->gateway);
---
select * from `currencies` where `currencies`.`id` = '1' limit 1
select * from `payment_gateways` where `payment_gateways`.`id` = '7' limit 1