app/Http/Controllers/User/TransferController.php

select * from `users` where `email` = 'fdsfdf' or `username` = 'fdsfdf' limit 1
---
    public function checkReceiver(Request $request){
        $receiver['data'] = User::where('email',$request->receiver)->orWhere('username',$request->receiver)->first();

select * from `generalsettings` limit 1
---
    public function transferForm()
    {
        $gs = Generalsetting::first();

select count(*) as aggregate from `transactions` where `user_id` = 1 and `remark` = 'transfer_money'
---
    public function transferHistory()
    {
        $transfers = Transaction::where('user_id',auth()->id())->where('remark','transfer_money')->latest()->paginate(15);