app/Http/Controllers/User/UserController.php

    public function index()
    {
        $referral = Referral::first();

        $data['recentOrders'] = Order::latest()->take(7)->get();
        $data['total']       = Order::where('user_id',auth()->id())->count();
        $data['completed']   = Order::where('user_id',auth()->id())->where('status','completed')->count();
        $data['processing']  = Order::where('user_id',auth()->id())->where('status','processing')->count();
        $data['in_progress'] = Order::where('user_id',auth()->id())->where('status','in progress')->count();
        $data['pending']     = Order::where('user_id',auth()->id())->where('status','pending')->count();
        $data['partial']     = Order::where('user_id',auth()->id())->where('status','partial')->count();
        $data['canceled']    = Order::where('user_id',auth()->id())->where('status','canceled')->count();
        $data['refunded']    = Order::where('user_id',auth()->id())->where('status','refunded')->count();
---
select * from `referrals` limit 1
select * from `orders` order by `created_at` desc limit 7
select count(*) as aggregate from `orders` where `user_id` = 1
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'completed'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'processing'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'in progress'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'pending'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'partial'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'canceled'
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'refunded'

    public function transactions()
    {
        $remark = request('remark');
        $search = request('search');

        $transactions = Transaction::where('user_id',auth()->id())
        ->when($remark,function($q) use($remark){
            return $q->where('remark',$remark);
        })
        ->when($search,function($q) use($search){
            return $q->where('trnx',$search);
        })
        ->with('currency')->latest()->paginate(15);
---
select * from `currencies` where 0 = 1
select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1

    public function trxDetails($id)
    {

        $transaction = Transaction::where('id',$id)->where('user_id',auth()->id())->first();
---
select * from `transactions` where `id` = '156' and `user_id` = 1 limit 1

    public function referrals()
    {
        $user = auth()->user();
        $referrals = $user->transactions()->whereIn('remark',['register_referral_bonus','deposit_referral_bonus'])->with('bonusfrom')->paginate(15);
---
select * from `transactions` where `transactions`.`user_id` = 1 and `transactions`.`user_id` is not null and `remark` in ('register_referral_bonus', 'deposit_referral_bonus') limit 15 offset 0
select * from `users` where `users`.`id` in (4)
select count(*) as aggregate from `transactions` where `transactions`.`user_id` = 1 and `transactions`.`user_id` is not null and `remark` in ('register_referral_bonus', 'deposit_referral_bonus')