app/Http/Controllers/User/UserOrderController.php

    public function newOrder()
    {
        $categories = Category::with('services')->where('status', 1)->get();
---
select * from `categories` where `status` = 1
select * from `services` where `services`.`category_id` in (1, 3, 4, 7, 16, 21, 34, 36, 57, 79, 92, 102, 120, 128, 132, 145, 162, 167, 173, 179, 182, 191, 204, 207, 250, 268, 277, 281, 290, 296, 299, 306, 309, 316, 318, 332, 340, 345, 346, 347, 349, 357, 378, 400, 424, 429, 433, 441, 458, 500, 502, 503, 504, 513, 525, 545, 554, 557, 566, 581, 593, 595, 613, 645, 658, 663, 664, 671, 673, 677, 678, 681, 684, 685, 689, 709, 712, 714, 748, 839, 901, 956, 1015, 1066, 1120, 1165, 1210, 1232, 1418, 1470, 1520, 1543, 1566, 1583, 1608, 1644, 1698, 1724, 1775, 1789, 1812, 1857, 1863, 1913, 1919, 1954, 1982, 1985)

    public function categoryService()
    {
        $services = Service::where('category_id', request('category_id'))->where('status',1)->get();
---
select * from `services` where `category_id` = '1' and `status` = 1

    public function getServiceDetails()
    {
        $service = Service::where('status',1)->find(request('service_id'));
---
select * from `services` where `status` = 1 and `services`.`id` = '1' limit 1

    public function orderHistory ()
    {
        $orders = Order::where('user_id', auth()->user()->id)
        ->when(request('status'), function($query){
            return $query->where('status', request('status'));
        })
        ->paginate(15);
---
select * from `orders` where `user_id` = 1 limit 15 offset 0
select count(*) as aggregate from `orders` where `user_id` = 1

    public function services()
    {
        $services = Service::when(request('category'), function($query){
            return $query->where('category_id', request('category'));
        })

        ->latest()
        ->paginate(15);

        $categories = Category::where('status',1)->get();
---
select * from `categories` where `status` = 1

    public function getServices()
    {
        $services = Service::when(request('name'), function($query){
            return $query->where('id',request('name'))
                ->orWhere('title', "like","%".request('name')."%");
        })
        ->latest()
        ->paginate(15);
---
select * from `services` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `services`