app/Http/Resources/User/UserResource.php

select * from `generalsettings` where `generalsettings`.`id` = 1 limit 1
---
    public function __construct()
    {
        $this->gs = Generalsetting::findOrFail(1);