app/Helpers/helpers.php

function getCurrencyCode(){
   return Session::has('currency') ? Currency::find(currency())->code : Currency::whereDefault(1)->first()->code;
---
select * from `currencies` where `default` = 1 limit 1