app/Http/Controllers/SupportTicketController.php

    public function index()
    {
        $user = auth()->user();
        $pref = 'user';
        $tickets = SupportTicket::where('user_id',$user->id)->latest()->paginate(15);
        $messages = TicketMessage::when(request('messages'),function($q){
            return $q->where('ticket_num',request('messages'));
        })->where('user_id',$user->id)->get();
---
select * from `support_tickets` where `user_id` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `support_tickets` where `user_id` = 1
select * from `ticket_messages` where `ticket_num` = 'TKT56470457' and `user_id` = 1