app/Http/Controllers/Admin/AdminController.php

    public function index()
    {
        $data['totalUser']       = User::where('email_verified',1)->count();
        $data['totalCurrency']   = Currency::count();
        $data['totalServices']   = Service::count();
        $data['totalOrders']     = Order::count();
        $data['totalRole']       = DB::table('roles')->count();
        $data['totalStaff']      = Admin::where('role','!=','super-admin')->count();
        $data['recentUsers']     = User::latest()->take(7)->get();
        $data['totalDeposit']    = round(Deposit::with('currency')->sum('default_curr_amount'),3);
        $data['totalProvider']   = Provider::count();
        $data['totalProfit']     = round(Transaction::where('charge','>',0)->sum('charge'),3);

        $orders = Order::selectRaw('count(CASE WHEN status = "completed"  THEN status END) AS completed')
            ->selectRaw('count(CASE WHEN status = "processing" THEN status END) AS processing')
            ->selectRaw('count(CASE WHEN status = "pending"    THEN status END) AS pending')
            ->selectRaw('count(CASE WHEN status = "progress"   THEN status END) AS progress')
            ->selectRaw('count(CASE WHEN status = "partial"    THEN status END) AS partial')
            ->selectRaw('count(CASE WHEN status = "canceled"   THEN status END) AS canceled')
            ->selectRaw('count(CASE WHEN status = "refunded"   THEN status END) AS refunded')
            ->get();
---
select count(*) as aggregate from `users` where `email_verified` = 1
select count(*) as aggregate from `currencies`
select count(*) as aggregate from `services`
select count(*) as aggregate from `orders`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `admins` where `role` != 'super-admin'
select * from `users` order by `created_at` desc limit 7
select sum(`default_curr_amount`) as aggregate from `deposits`
select count(*) as aggregate from `providers`
select sum(`charge`) as aggregate from `transactions` where `charge` > 0
select count(CASE WHEN status = "completed"  THEN status END) AS completed, count(CASE WHEN status = "processing" THEN status END) AS processing, count(CASE WHEN status = "pending"    THEN status END) AS pending, count(CASE WHEN status = "progress"   THEN status END) AS progress, count(CASE WHEN status = "partial"    THEN status END) AS partial, count(CASE WHEN status = "canceled"   THEN status END) AS canceled, count(CASE WHEN status = "refunded"   THEN status END) AS refunded from `orders`

            $data['order']['refunded']   = $order->refunded;
        }

        $deposits = Deposit::selectRaw('count(id) as totalDepositCount')
            ->selectRaw('count(CASE WHEN status = "completed"  THEN status END) AS completed')
            ->selectRaw('count(CASE WHEN status = "pending"    THEN status END) AS pending')
            ->selectRaw('count(CASE WHEN status = "rejected"   THEN status END) AS rejected')
            ->get();
---
select count(id) as totalDepositCount, count(CASE WHEN status = "completed"  THEN status END) AS completed, count(CASE WHEN status = "pending"    THEN status END) AS pending, count(CASE WHEN status = "rejected"   THEN status END) AS rejected from `deposits`

    public function referral()
    {
        $referral = Referral::first();
---
select * from `referrals` limit 1