app/Http/Controllers/Admin/ManageServiceController.php

select * from `categories` where `status` = 1
select * from `providers` where `status` = 1
---
    public function create()
    {
        $categories = Category::where('status', 1)->get();
        $providers  = Provider::where('status', 1)->get();

select * from `categories` where `status` = 1
select * from `providers` where `status` = 1
---
    public function importService()
    {
        $categories = Category::where('status', 1)->get();
        $providers  = Provider::where('status', 1)->get();